src/DataProcessors/ГруппововеИзмененияПроцентовПоКонтрактам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГруппововеИзмененияПроцентовПоКонтрактам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДопСоглашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьКонтракт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрактПоследнийДействующий</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТрудовойДоговор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийНачалоКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийОкончаниеКонтракта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийДействующийПроцентПоКонтракту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйПроцентПоКонтракту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДопСоглашения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВступленияВСилу</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьСотрудник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаПодразделений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипТрудовогоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипТрудовогоДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ОтветственныеЛицаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаПодразделений</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаместительРуководителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительСтруктурногоПодразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ГруппововеИзмененияПроцентовПоКонтрактам/Ext/ObjectModule.bsl
Функция СформироватьЗапросПоОтветствЛицамПод(ВыбПодразделение, ВыбОтветственноеЛицо)
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ВыбПодразделение);
    Запрос.УстановитьПараметр("ОтветственноеЛицо",ВыбОтветственноеЛицо);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()
 

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура СформироватьОтчет() Экспорт
	
	//ТабличнаяЧастьКонтракт.Очистить();
	
	Если ТабличнаяЧастьКонтракт.Количество() > 0 Тогда
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		Иначе
			ТабличнаяЧастьКонтракт.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличнаяЧастьКонтракт.Количество() = 0 или Ответ = КодВозвратаДиалога.Да Тогда
		Запрос = Новый Запрос;
		СписокТиповТрудовогоДоговора = Новый СписокЗначений;
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Заключен);
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Продлен);
		
		СписокСотрудников = Новый СписокЗначений;
		Для каждого НоваяСтр Из ТабличнаяЧастьСотрудник Цикл
			Если ПустаяСтрока(НоваяСтр.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",СписокТиповТрудовогоДоговора);
			Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
			Запрос.УстановитьПараметр("Список",НоваяСтр.Сотрудник);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботникиОрганизацийСрезПоследних.Организация,
			|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
			|	РаботникиОрганизацийСрезПоследних.Должность,
			|	ТрудовыеДоговораСрезПоследних.Период,
			|	ТрудовыеДоговораСрезПоследних.Регистратор,
			|	ТрудовыеДоговораСрезПоследних.Сотрудник КАК Сотрудник,
			|	ТрудовыеДоговораСрезПоследних.ВидДоговора,
			|	ТрудовыеДоговораСрезПоследних.НомерТД,
			|	ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора,
			|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
			|	ТрудовыеДоговораСрезПоследних.ОкончаниеДоговора,
			|	ТрудовыеДоговораСрезПоследних.ПроцентПоКонтракту
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних КАК РаботникиОрганизацийСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора.СрезПоследних КАК ТрудовыеДоговораСрезПоследних
			|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
			|ГДЕ
			|	ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора В (&ДействиеТрудовогоДоговора)
			|   И ТрудовыеДоговораСрезПоследних.ВидДоговора = &ВидДоговора
			|	И ТрудовыеДоговораСрезПоследних.Сотрудник = &Список";
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Пока Результат.Следующий() Цикл
				НоваяСтрока = ТабличнаяЧастьКонтракт.Добавить();
				НоваяСтрока.Сотрудник = Результат.Сотрудник;
				НоваяСтрока.ТН = Результат.Сотрудник.Код;
				НоваяСтрока.Должность = Результат.Должность;
				НоваяСтрока.Подразделение = Результат.ПодразделениеОрганизации;
				НоваяСтрока.КонтрактПоследнийДействующий = Результат.Регистратор;
				НоваяСтрока.ПоследнийДействующийНачалоКонтракта = Результат.НачалоДоговора;
				НоваяСтрока.ПоследнийДействующийОкончаниеКонтракта = Результат.ОкончаниеДоговора;
				НоваяСтрока.ПоследнийДействующийПроцентПоКонтракту = Результат.ПроцентПоКонтракту;
				НоваяСтрока.НовыйПроцентПоКонтракту = Результат.ПроцентПоКонтракту;
				НоваяСтрока.Организация = Результат.Организация;
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры // ()

Процедура СформироватьПриказ() Экспорт
	
	ТЗ_Подр = Новый ТаблицаЗначений;
	ТЗ_Подр.Колонки.Добавить("Код");
	ТЗ_Подр.Колонки.Добавить("Подразделение");
	
	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		Если ТекСтрока.ПоследнийДействующийПроцентПоКонтракту = ТекСтрока.НовыйПроцентПоКонтракту Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрТЗ = ТЗ_Подр.Добавить();
		НоваяСтрТЗ.Код = ТекСтрока.Подразделение.Код;
		НоваяСтрТЗ.Подразделение = ТекСтрока.Подразделение;
	КонецЦикла;
	ТЗ_Подр.Свернуть("Код, Подразделение");
	ТЗ_Подр.Сортировать("Код Возр, Подразделение");
	
	Организация = СокрЛП(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").Наименование);
	
	//найдем ответственное лицо = руководитель, руководителя кадров
	РуководительФИО =""; ГлавныйБухгалтерФИО = ""; ГлавныйЮристконсультФИО = "";
	ГлавныйЭкономистФИО = ""; РуководительКадровойСлужбыФИО = ""; СпециалистКадровойСлужбыФИО = "";
	СпрОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; ГлавныйБухгалтерНашли = 0; СпециалистКадровойСлужбыНашли = 0;
	ГлавныйЮристконсультНашли = 0; ГлавныйЭкономистНашли = 0; РуководительКадровойСлужбыНашли = 0;
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				РуководительНашли = 1;
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер и ГлавныйБухгалтерНашли = 0 Тогда
				ГлавныйБухгалтерФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйБухгалтерНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйЮристконсульт и ГлавныйЮристконсультНашли = 0 Тогда
				ГлавныйЮристконсультФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйЮристконсультНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйЭкономист и ГлавныйЭкономистНашли = 0 Тогда
				ГлавныйЭкономистФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				ГлавныйЭкономистНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.РуководительКадровойСлужбы и РуководительКадровойСлужбыНашли = 0 Тогда
				РуководительКадровойСлужбыФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				РуководительКадровойСлужбыНашли = 1;	
			ИначеЕсли НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.СпециалистКадровойСлужбы и СпециалистКадровойСлужбыНашли = 0 Тогда
				СпециалистКадровойСлужбыСлужбыФИО = ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(НоваяСтр.Сотрудник.Наименование);
				СпециалистКадровойСлужбыСлужбыНашли = 1;					
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Приказ об установлении повышения тарифной ставки.dot";
    ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	Для Каждого ТекСтрокаТЧ Из ТЗ_Подр Цикл
		Попытка
						
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("НовыйПроцентПоКонтракту", Новый ОписаниеТипов("Число"));
			ТЗ.Колонки.Добавить("Сотрудник");
			ТЗ.Колонки.Добавить("Должность");
			ТЗ.Колонки.Добавить("Подразделение");
			
			Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
				Если ТекСтрока.Подразделение <> ТекСтрокаТЧ.Подразделение Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТекСтрока.ПоследнийДействующийПроцентПоКонтракту = ТекСтрока.НовыйПроцентПоКонтракту Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрТЗ = ТЗ.Добавить();
				НоваяСтрТЗ.НовыйПроцентПоКонтракту = ТекСтрока.НовыйПроцентПоКонтракту;
				НоваяСтрТЗ.Сотрудник = ТекСтрока.Сотрудник;
				НоваяСтрТЗ.Должность = ТекСтрока.Должность;
			КонецЦикла;
			ТЗ.Сортировать("НовыйПроцентПоКонтракту Возр, Сотрудник Возр");
			
			Строка = ""; н = 1; н_контракт = 0;  ТекПроцентКонтракта = "";
			Для Каждого ТекСтрока Из ТЗ Цикл
				
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 3, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				Строка = Строка + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(ФИО) + ?(н = ТЗ.Количество(), "", ", ");
				н = н + 1;
				Если ТекПроцентКонтракта <> ТекСтрока.НовыйПроцентПоКонтракту Тогда
					н_контракт = н_контракт + 1;
				КонецЕсли;
				ТекПроцентКонтракта = ТекСтрока.НовыйПроцентПоКонтракту;
			КонецЦикла;
			
			Если Не ВыбФайл.Существует() Тогда
				Приказ = ПолучитьМакет("ПриказНаИзменениеПроцентовПоКонтрактам");
				MSWord = Приказ.Получить();// Получить объект из макета.
				Документ = MSWord.Application.Documents(1);
			Иначе
				MSWord = новый COMОбъект("Word.Application");
				Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
			КонецЕсли;
			
			Документ.Activate();
			
			Замена = Документ.Content.Find;
			Замена.Execute("_СписокСотрудниковФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, Строка);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаВступления", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаВступленияВСилу,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, Организация);
			
			Таблица=Документ.Tables(3);
			Кол = н + н_контракт*2 - 1;
			Для к = 1 по Кол Цикл
				Таблица.Rows.Add();
			КонецЦикла;
			
			
			ТекПроцентКонтракта = "";  Номер = 1; y = 0; Кол = 1;
			Для Каждого ТекСтрока Из ТЗ Цикл
				
				Если ТекПроцентКонтракта = "" или ТекПроцентКонтракта <> ТекСтрока.НовыйПроцентПоКонтракту Тогда 
					Кол = Кол + 1;
					y = y + 1;
					Таблица.Cell(Кол,1).Range.Text = "1." + Строка(y) + ". в размере " + Строка(ТекСтрока.НовыйПроцентПоКонтракту) + "%:";
					Кол = Кол + 1;
				КонецЕсли;
				
				ТекПроцентКонтракта = ТекСтрока.НовыйПроцентПоКонтракту;
				
				Замена = Документ.Content.Find;
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Сотрудник.Наименование, 3, ТекСтрока.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					ФИО = РезультатСклонения;	
				КонецЕсли;
				Фамилия = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Имя = ОбщегоНазначения.ВыделитьСлово(ФИО);
				Отчество = ОбщегоНазначения.ВыделитьСлово(ФИО);
				РезультатСклоненияДолжность = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ТекСтрока.Должность.Наименование, 3, , ТекСтрока.Должность, 1);
				Таблица.Cell(Кол,1).Range.Text = ВРег(Фамилия) + " " + Имя  + " " + Отчество + ", " + НРег(РезультатСклоненияДолжность) + ";";
				Кол = Кол + 1;
				
			КонецЦикла;
			
			Замена = Документ.Content.Find;
			Если ЗначениеЗаполнено(ТекСтрокаТЧ.Подразделение.Родитель) Тогда
				НаименованиеПодразделения = ТекСтрокаТЧ.Подразделение.Наименование;
				НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
				НаименованиеПодразделения = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НаименованиеПодразделения, 2, , ТекСтрокаТЧ.Подразделение, 1);
				
				ЦехНаименование = СокрЛП(ТекСтрокаТЧ.Подразделение.Родитель.Наименование);
				ЦехНаименование = НРег(Лев(ЦехНаименование,1)) + Прав(ЦехНаименование,СтрДлина(ЦехНаименование) - 1);
				ЦехНаименование = ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),ЦехНаименование, 2, , ТекСтрокаТЧ.Подразделение.Родитель, 1);
				
				Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь,  НаименованиеПодразделения + " " + ЦехНаименование);
			Иначе
				НаименованиеПодразделения = ТекСтрокаТЧ.Подразделение.Наименование;
				НаименованиеПодразделения = НРег(Лев(НаименованиеПодразделения,1)) + Прав(НаименованиеПодразделения,СтрДлина(НаименованиеПодразделения) - 1);
				
				Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ПросклонятьСтрРезультат(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НаименованиеПодразделения, 2, , ТекСтрокаТЧ.Подразделение, 1));
			КонецЕсли;
			Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь, НРег(ТекСтрокаТЧ.Подразделение.Наименование));
			
			////////////////////
			Замена = Документ.Content.Find;
			Замена.Execute("_НачальникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, "");
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаДопСоглашения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ДатаДопСоглашения,"ДЛФ=DD"));
			
			//вывод подписей
			Замена = Документ.Content.Find;
			Замена.Execute("_Руководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_НачальникОК", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительКадровойСлужбыФИО);
			
			Замена = Документ.Content.Find;
			Если ЗначениеЗаполнено(ТекСтрокаТЧ.Подразделение.Родитель) тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрокаТЧ.Подразделение.Родитель, Перечисления.ОтветственныеЛицаПодразделений.ЗаместительРуководителя).Выбрать();
			Иначе
				Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрокаТЧ.Подразделение, Перечисления.ОтветственныеЛицаПодразделений.ЗаместительРуководителя).Выбрать();
			КонецЕсли;
			Пока Результат.Следующий() Цикл
				Замена.Execute("_Заместитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Результат.ФизическоеЛицо.Наименование));
			КонецЦикла;
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Юристконсульт", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйЮристконсультФИО);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Бухгалтер", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйБухгалтерФИО);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Экономист", Ложь, Истина, Ложь, , , Истина, , Ложь, ГлавныйЭкономистФИО);
			
			Замена = Документ.Content.Find;
			Если ЗначениеЗаполнено(ТекСтрокаТЧ.Подразделение.Родитель) тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрокаТЧ.Подразделение.Родитель, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
			Иначе
				Результат = СформироватьЗапросПоОтветствЛицамПод(ТекСтрокаТЧ.Подразделение, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
			КонецЕсли;
			Пока Результат.Следующий() Цикл
				Замена.Execute("_НачальникПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(Результат.ФизическоеЛицо.Наименование));				
			КонецЦикла;
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Подразделение", Ложь, Истина, Ложь, , , Истина, , Ложь, НРег(ТекСтрокаТЧ.Подразделение.Наименование));
			
			Таблица=Документ.Tables(6);
			Кол = (н - 1) * 2;
			Для к = 1 по Кол Цикл
				Таблица.Rows.Add();
			КонецЦикла;
			
			Кол = 1;
			Для Каждого ТекСтрока Из ТЗ Цикл
				Таблица.Cell(Кол,1).Range.Text = "                             " + ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТекСтрока.Сотрудник.Наименование);
				Кол = Кол + 1;
				Таблица.Cell(Кол,1).Range.Text = "__." + Строка(Месяц(ДатаПриказа))+ "." + Формат(Год(ДатаПриказа),"ЧГ=0");
				Кол = Кол + 1;			
			КонецЦикла;
			
			MSWord.Application.Visible = Истина; 
			MSWord.Activate(); 
		Исключение
			Сообщить(ОписаниеОшибки());
			MSWord.Application.Quit();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДопСоглашение() Экспорт
	
	ТЗ_ТабличнаяЧасть = Новый ТаблицаЗначений;
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Код");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Подразделение");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Сотрудник");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Должность");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("НовыйПроцентПоКонтракту", Новый ОписаниеТипов("Число"));
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("ДатаДопСоглашения");
    ТЗ_ТабличнаяЧасть.Колонки.Добавить("ДатаВступленияВСилу");
	ТЗ_ТабличнаяЧасть.Колонки.Добавить("Организация");

	КолСтраниц = 0;

	Для Каждого ТекСтрока Из ТабличнаяЧастьКонтракт Цикл
		Если ТекСтрока.ПоследнийДействующийПроцентПоКонтракту = ТекСтрока.НовыйПроцентПоКонтракту Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрТЗ = ТЗ_ТабличнаяЧасть.Добавить();
		НоваяСтрТЗ.Код = ТекСтрока.Подразделение.Код;
		НоваяСтрТЗ.Подразделение = ТекСтрока.Подразделение;
		НоваяСтрТЗ.Сотрудник = ТекСтрока.Сотрудник;
		НоваяСтрТЗ.Должность = ТекСтрока.Должность;
		НоваяСтрТЗ.НовыйПроцентПоКонтракту = ТекСтрока.НовыйПроцентПоКонтракту;
		НоваяСтрТЗ.ДатаДопСоглашения = ТекСтрока.ДатаДопСоглашения;
		НоваяСтрТЗ.ДатаВступленияВСилу = ТекСтрока.ДатаВступленияВСилу;
		НоваяСтрТЗ.Организация = ТекСтрока.Организация;
		
		КолСтраниц = КолСтраниц + 1;

	КонецЦикла;
	ТЗ_ТабличнаяЧасть.Сортировать("Код Возр, Подразделение, Сотрудник Возр");
	
	Организация = СокрЛП(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").Наименование);
	
	//найдем ответственное лицо = руководитель, руководителя кадров
	РуководительФИО =""; 
	СпрОрганизации = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация").ПолучитьОбъект();
	ТЗ = СпрОрганизации.ОтветственныеЛица.Выгрузить();
	ТЗ.Сортировать("Дата Убыв"); 
	РуководительНашли = 0; 
	Для Каждого НоваяСтр из ТЗ Цикл
		Если РабочаяДата >= НоваяСтр.Дата Тогда
			РезультатСклонения = ""; ФИО = "";
			Если НоваяСтр.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель и РуководительНашли = 0 Тогда
				РуководительФИО = СокрЛП(НоваяСтр.Сотрудник.Наименование);
				РезультатСклонения = "";
				Если ПроцедурыУправленияПерсоналом.ПросклонятьФИО(глЗначениеПеременной("глКомпонентаСклоненияФИО"),НоваяСтр.Сотрудник.Наименование, 2, НоваяСтр.Сотрудник.Физлицо.Пол, РезультатСклонения) Тогда
					РуководительФИО_Падеж = РезультатСклонения;	
				КонецЕсли;				
				РуководительНашли = 1;
				КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	РабочийКаталог = УниверсальныеМеханизмы.ПолучитьИмяКаталога(ТекущийПользователь);
	ИмяФайла = "Дополнительное соглашение к контракту (изменение тарифной ставки).dot";
	ВыбФайл = Новый Файл(РабочийКаталог + "\" + ИмяФайла);
	
	Если Не ВыбФайл.Существует() Тогда
		Приказ = ПолучитьМакет("ДопСоглашение");
		MSWord = Приказ.Получить();// Получить объект из макета.
		Документ = MSWord.Application.Documents(1);
	Иначе
		MSWord = новый COMОбъект("Word.Application");
		Документ = MSWord.Documents.Add(РабочийКаталог + "\" + ИмяФайла);
	КонецЕсли;	

	MSWord.Application.Visible = Истина; 
	MSWord.Activate(); 
	
	Если КолСтраниц > 1 Тогда
		ПервыйПараграф = 1;
		Параграфов = 34;
		
		Для Н = 2 по КолСтраниц Цикл
			
			Для НН = 1 По Параграфов Цикл
				Если Н = КолСтраниц и НН = Параграфов Тогда
				Иначе
					MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1)).Range.Copy();
					MSWord.ActiveDocument.Paragraphs.Add(MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).Range);
					MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).Range.Paste();
					MSWord.ActiveDocument.Paragraphs(ПервыйПараграф + (НН - 1) + Параграфов * (Н - 1)).FirstLineIndent = MSWord.ActiveDocument.Paragraphs(ПервыйПараграф  + (НН - 1)).FirstLineIndent;
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;
		
	КонЕцесли;
	
	Для Каждого ТекСтрока Из ТЗ_ТабличнаяЧасть Цикл
		Попытка
			//заполнение 1 части
			Замена = Документ.Content.Find;
			Если ЗначениеЗаполнено(ТекСтрока.Подразделение.Родитель) Тогда
				Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Родитель.Код));	
			Иначе
				Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Код));
			КонецЕсли;			
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаДопСоглашения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ДатаДопСоглашения,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Организация.Наименование));
						
			Замена = Документ.Content.Find;
			Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО_Падеж);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_РаботникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Сотрудник.Наименование));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ПроцентКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, ТекСтрока.НовыйПроцентПоКонтракту);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаВступления", Ложь, Истина, Ложь, , , Истина, , Ложь, СтрЗаменить(Формат(ТекСтрока.ДатаВступленияВСилу,"ДЛФ=DD"),"г.",""));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ИОФРуководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РуководительФИО));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ИОФРаботник", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТекСтрока.Сотрудник.Наименование));
			
			//заполнение 2 части
			Замена = Документ.Content.Find;
			Если ЗначениеЗаполнено(ТекСтрока.Подразделение.Родитель) Тогда
				Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Родитель.Код));	
			Иначе
				Замена.Execute("_КодПодр", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Подразделение.Код));
			КонецЕсли;			
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаДопСоглашения", Ложь, Истина, Ложь, , , Истина, , Ложь, Формат(ТекСтрока.ДатаДопСоглашения,"ДЛФ=DD"));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_Организация", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Организация.Наименование));
						
			Замена = Документ.Content.Find;
			Замена.Execute("_РуководительФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, РуководительФИО_Падеж);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_РаботникФИО", Ложь, Истина, Ложь, , , Истина, , Ложь, СокрЛП(ТекСтрока.Сотрудник.Наименование));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ПроцентКонтракта", Ложь, Истина, Ложь, , , Истина, , Ложь, ТекСтрока.НовыйПроцентПоКонтракту);
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ДатаВступления", Ложь, Истина, Ложь, , , Истина, , Ложь, СтрЗаменить(Формат(ТекСтрока.ДатаВступленияВСилу,"ДЛФ=DD"),"г.",""));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ИОФРуководитель", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(РуководительФИО));
			
			Замена = Документ.Content.Find;
			Замена.Execute("_ИОФРаботник", Ложь, Истина, Ложь, , , Истина, , Ложь, ПроцедурыУправленияПерсоналом.ИнициалыФамилияФизЛица(ТекСтрока.Сотрудник.Наименование));

			//MSWord.Application.Visible = Истина; 
			//MSWord.Activate(); 
		Исключение
			Сообщить(ОписаниеОшибки());
			MSWord.Application.Quit();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
